app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) values ('Vishal', 'Vish_191', 'Vishalkumar9955@gmail.com', '$2y$10$0u6Z9zfGc31yqn3vvJQIAet2/faWsV9ZNpiATc5tKLJqtH9ghPJRi', '2023-05-22 10:37:19', '2023-05-22 10:37:19')
---
    public function store(Request $request)
    {
        $this->validate($request, [
            'name' => 'required|max:255',
            'username' => 'required|max:255',
            'email' => 'required|email|max:255',
            'password' => 'required|confirmed',
        ]);

        User::create([
            'name' => $request->name,
            'username' => $request->username,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);