app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::latest()->with(['user', 'likes'])->paginate(20);
---
select * from `likes` where `likes`.`post_id` in (1) and `likes`.`deleted_at` is null
select * from `posts` order by `created_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `posts`

    public function store(Request $request)
    {
        $this->validate($request, [
            'body' => 'required'
        ]);

        $request->user()->posts()->create($request->only('body'));
---
insert into `posts` (`body`, `user_id`, `updated_at`, `created_at`) values ('Hii', 1, '2023-05-22 10:37:39', '2023-05-22 10:37:39')